# Part Three

Part 3: Construct and export a MySQL database using your data.

In [1]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import numpy as np

import pymysql
pymysql.install_as_MySQLdb()

from sqlalchemy import create_engine
from sqlalchemy_utils import database_exists, create_database
from sqlalchemy.types import *
import pandas as pd

In [2]:
df = pd.read_csv("Data/title_basics.csv.gz")
df.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020.0,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama

## 1. Getting List of Unique Genres

In [3]:
## create a col with a list of genres
df['genres_split'] = df['genres'].str.split(',')
df.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020.0,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama,[Drama]
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama,[Drama]

In [4]:
# exploding the column of lists and taking a head sample to see the results
exploded_genres =df.explode('genres_split')
exploded_genres.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020.0,NaN,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama,Drama

In [5]:
# saving the unique values from the exploded column 
unique_genres = sorted(exploded_genres['genres_split'].unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

## 2. Create a new title_genres table

In [6]:
# Saving the tconst and genres split as new df

title_genres = exploded_genres[['tconst', 'genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

## 3. Create a genre mapper dictionary to replace string genres with integers

In [7]:
# making the genre mapper dict

genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

## 4. Replace the string genres in title_genres with the new integer ids.

In [8]:
# making a new column for genre id
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres.drop(columns='genres_split', inplace=True)
title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0069049         7

## 5. Convert the genre map dictionary into a dataframe.

In [57]:
# manually making a dataframe with named collumns from the .keyd and .values

genres = pd.DataFrame({'genre_name': genre_map.keys(),
                             'genre_id': genre_map.values()})
genres.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [10]:
# importing the remaining data in order to create the tables

ratings = pd.read_csv("Data/title_ratings.csv.gz")
tmdb = pd.read_csv("Data/tmdb_results_combined.csv.gz")

# Discarding Unnecessary Information

For the title basics table, drop the following columns:
"original_title" (we will use the primary title column instead)
"isAdult" ("Adult" will show up in the genres so this is redundant information).
"titleType" (every row will be a movie).
"genres" and other variants of genre (genre is now represented in the 2 new tables described above.

In [11]:
# dropping the aforementioned columns unnecessary information

df.drop(columns=['originalTitle', 'isAdult', 'titleType', 'genres', 'genres_split','endYear' ], inplace=True)
df.head()

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0088751,The Naked Monster,2005.0,100
4,tt0096056,Crime and Punishment,2002.0,126

In [12]:
tm_df = tmdb[['imdb_id', 'revenue', 'budget', 'certification']]
tm_df.head()

     imdb_id     revenue      budget certification
0          0         NaN         NaN           NaN
1  tt0113026         0.0  10000000.0           NaN
2  tt0113092         0.0         0.0           NaN
3  tt0116391         0.0         0.0           NaN
4  tt0118694  12854953.0    150000.0            PG

# Saving the MySQL tables with tconst as the primary key.

## 1. Creating a dataype schema for to_sql:

In [20]:
# creating connection to database with sqlalchemy

connection = "mysql+pymysql://root:root@localhost/movies"
engine = create_engine(connection)

In [22]:
# checking if database is created and if not creating it
if database_exists(connection):
    print('It exists')
else:
    create_database(connection)
    print('Database created.')

Database created.

In [23]:
# chekcing the data types of the basics df
basics = df.copy()
basics.dtypes

tconst             object
primaryTitle       object
startYear         float64
runtimeMinutes      int64
dtype: object

In [25]:
## Calculate max string lengths for object columns
key_len = basics['tconst'].fillna('').map(len).max()
title_len = basics['primaryTitle'].fillna('').map(len).max()

In [26]:
# creating the dictionary for the datatypes of basics
basic_dict = {'tconst': String(key_len+1),
             'primaryTitle': Text(title_len+1),
             'startYear': Integer(),
             'runtimeMinutes': Integer()}

In [19]:
# chekcing the data types of the ratings df
ratings.dtypes

tconst            object
averageRating    float64
numVotes           int64
dtype: object

In [30]:
## Calculate max string lengths for object columns
key_len = ratings['tconst'].fillna('').map(len).max()

In [31]:
# creating the dictionary for the datatypes of basics
ratings_dict = {'tconst': String(key_len+1),
             'averageRating': Float(),
             'numVotes': Integer()}

In [36]:
# chekcing the data types of the tmdb
tm_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2502 entries, 0 to 2501
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   imdb_id        2502 non-null   object
 1   revenue        2500 non-null   float64
 2   budget         2500 non-null   float64
 3   certification  797 non-null    object
dtypes: float64(2), object(2)
memory usage: 78.3+ KB

In [37]:
## Calculate max string lengths for object columns
key_len = tm_df['imdb_id'].fillna('').map(len).max()
cert_len = tm_df['certification'].fillna('').map(len).max()

In [38]:
# creating the dictionary for the datatypes of basics
tmdb_dict = {'imdb_id': String(key_len+1),
             'revenue': Float(),
             'budget': Float(),
             'certification': Text(title_len+1)}

In [46]:
tm_df.drop_duplicates(inplace=True)

C:\Users\dvisi\AppData\Local\Temp\ipykernel_4316\468282512.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  tm_df.drop_duplicates(inplace=True)

In [51]:
# looking at the data types of the title_genres
title_genres.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 158196 entries, 0 to 84967
Data columns (total 2 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   tconst    158196 non-null  object
 1   genre_id  158196 non-null  int64
dtypes: int64(1), object(1)
memory usage: 3.6+ MB

In [61]:
## Calculate max string lengths for object columns
key_len = title_genres['tconst'].fillna('').map(len).max()

In [62]:
# creating the title genres dictionary
title_genres_dict = {'tconst': Text(key_len+1),'genre_id': Integer()}

In [63]:
# looking at the data types of the genres 
genres.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26 entries, 0 to 25
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   genre_name  26 non-null     object
 1   genre_id    26 non-null     int64
dtypes: int64(1), object(1)
memory usage: 544.0+ bytes

In [64]:
## Calculate max string lengths for object columns
key_len = genres['genre_name'].fillna('').map(len).max()

In [65]:
# creating the dictionary for the datatypes of genres
genres_dict = {'genre_name': String(title_len+1),
             'revenue': Integer()}

## 2. Run df.to_sql with the dtype argument.

In [27]:
# Saving to SQL with dtype and index being False
basics.to_sql('title_basics', engine, dtype=basic_dict, if_exists='replace', index=False)

84968

In [32]:
# Saving to SQL with dtype and index being False
ratings.to_sql('title_ratings', engine, dtype=ratings_dict, if_exists='replace', index=False)

477585

In [47]:
# Saving to SQL with dtype and index being False
tm_df.to_sql('tmdb_data', engine, dtype=tmdb_dict, if_exists='replace', index=False)

2501

In [66]:
# Saving to SQL with dtype and index being False
title_genres.to_sql('title_genres', engine, dtype=title_genres_dict, if_exists='replace', index=False)

158196

In [67]:
# Saving to SQL with dtype and index being False
genres.to_sql('genres', engine, dtype=genres_dict, if_exists='replace', index=False)

26

## 3. Run the query to ADD PRIMARY KEY

In [29]:
# Setting the and adding primary key

engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [33]:
# Setting the and adding primary key

engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [48]:
# Setting the and adding primary key

engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

In [68]:
# Setting the and adding primary key

engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`genre_name`);')

## 4. Tables and Queries

In [50]:
# running a query to show first 5 rows of the title_basics table

q="""SELECT * FROM title_basics LIMIT 5"""
pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70
2,tt0069049,The Other Side of the Wind,2018,122
3,tt0088751,The Naked Monster,2005,100
4,tt0096056,Crime and Punishment,2002,126

In [58]:
# running a query to show first 5 rows of the title_basics table

q="""SELECT * FROM tmdb_data LIMIT 5"""
pd.read_sql(q, engine)

     imdb_id     revenue      budget certification
0          0         NaN         NaN          None
1  tt0035423  76019000.0  48000000.0         PG-13
2  tt0113026         0.0  10000000.0          None
3  tt0113092         0.0         0.0          None
4  tt0114447         0.0         0.0          None

In [59]:
# running a query to show first 5 rows of the title_basics table

q="""SELECT * FROM title_ratings LIMIT 5"""
pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1913
1  tt0000002            5.8       258
2  tt0000005            6.2      2534
3  tt0000006            5.1       174
4  tt0000007            5.4       792

In [69]:
# running a query to show first 5 rows of the title_basics table

q="""SELECT * FROM title_genres LIMIT 5"""
pd.read_sql(q, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

In [70]:
# running a query to show first 5 rows of the title_basics table

q="""SELECT * FROM genres LIMIT 5"""
pd.read_sql(q, engine)

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [73]:
# showing all tables in the database
q ="SHOW TABLES"
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data